tutorials/multiphase/overInterDyMFoam/boatAndPropeller/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication decomposePar
runParallel overInterDyMFoam

#------------------------------------------------------------------------------
