tutorials/multiphase/overInterDyMFoam/boatAndPropeller/system/topoSetDictHull_pokus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    hullBox0;       // all around bgr
        type    cellSet;
        action  new;
        source  regionToCell;
        sourceInfo
        {
            insidePoints ((0.3 0.001 0.001));
        }
    }



    // Select box to remove from region 1 and 2

    // {
    //     name    box; //all but hullBox0 region
    //     type    cellSet;
    //     action  new;
    //     source  cellToCell;
    //     sourceInfo
    //     {
    //         set c0;
    //     }
    // }

    {
        name    box; // all cells including hullBox0
        type    cellSet;
        action  new; // was: add;
        source  cellToCell;
        sourceInfo
        {
            set hullBox0;
        }
    }


    {
        name    box;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            boxes
            (
                 (0.0501 -0.1 -0.1)(0.5 0.1 0.1) //hullBox
            //      (0 -1 -1)(5 1 1) //hullBox
            //     (-0.02 -0.05 -0.03)( -0.01 0.05 0.03) //propeller
            //     (-0.08 -0.08 -0.03)(-0.06 0.08 0.03) //rudder
            );
        }
    }

    {
        name    box;
        type    cellSet;
        action  invert;
    }

    {
        name    c0;            //copy
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set hullBox0;
        }
    }

    {
        name    c0;          //all cells but hullBox0 region
        type    cellSet;
        action  invert;
    }
    {
        name    box; // all cells including hullBox0
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set c0;
        }
    }

);

// ************************************************************************* //
