tutorials/multiphase/overInterDyMFoam/boatAndPropeller/system/topoSetDictRudder
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
      name    bgr0;       // all around bgr
  //    set     hullBox0set;
      type    cellSet;
      action  new;
      source  zoneToCell;
      sourceInfo
      {
          name    background;
      }
    }
    {
        name    hullBox0;       // all around hull
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    hullBox;
        }
    }
    {
        name    propeller0;       // all around propeller
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    propeller;
        }
    }
    {
        name    rudder0;       // all around rudder
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    rudder;
        }
    }

    {
        name    box;   //all cells
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set rudder0;
        }
    }


    {
        name    box;   // hole in mesh
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            boxes
            (
            //     (0.15 -0.1 -0.1)(0.5 0.1 0.1) //hullBox
            //     (-0.02 -0.05 -0.03)( -0.01 0.05 0.03) //propeller
            (-0.10 -0.0749 -0.00499)(-0.050 0.0749 0.00499) //rudder
            );
        }
    }

    {
        name    box;
        type    cellSet;
        action  invert;
    }
    {
        name    keepBox;   //all cells
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set box;
        }
    }
    {
        name    keepBox;   //all cells
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set propeller0;
        }
    }
    {
        name    keepBox;   //all cells
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set hullBox0;
        }
    }
    {
        name    keepBox;   //all cells
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set bgr0;
        }
    }

);

// ************************************************************************* //



// /*--------------------------------*- C++ -*----------------------------------*\
// | =========                 |                                                 |
// | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
// |  \\    /   O peration     | Version:  plus-overset                          |
// |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
// |    \\/     M anipulation  |                                                 |
// \*---------------------------------------------------------------------------*/
// FoamFile
// {
//     version     2.0;
//     format      ascii;
//     class       dictionary;
//     object      topoSetDict;
// }
// // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// actions
// (
//     {
//         name    rudder0;       // all around bgr
//         type    cellSet;
//         action  new;
//         source  zoneToCell;
//         sourceInfo
//         {
//            name rudder;
//             //insidePoints ((-0.11 0.0 0.0));
//         }
//     }
//     {
//         name    c0;            //copy
//         type    cellSet;
//         action  new;
//         source  cellToCell;
//         sourceInfo
//         {
//             set rudder0;
//         }
//     }
//
//     {
//         name    c0;          //all around hullBox0
//         type    cellSet;
//         action  invert;
//     }
//
// /*
//
//     {
//         name    c1;
//         type    cellSet;
//         action  new;
//         source  regionsToCell;
//         sourceInfo
//         {
//             insidePoints ((-0.01 0.0 0.0));
//             set          c0;
//         }
//     }
//
//
//
//
//
//    {
//         name    c1;
//         type    cellSet;
//         action  delete;
//         source  cellToCell;
//         sourceInfo
//         {
//             set c2;
//         }
//     }
// */
//     // Select box to remove from region 1 and 2
//
//     {
//         name    box;
//         type    cellSet;
//         action  new;
//         source  cellToCell;
//         sourceInfo
//         {
//             set c0;
//         }
//     }
//
//     {
//         name    box;
//         type    cellSet;
//         action  add;
//         source  cellToCell;
//         sourceInfo
//         {
//             set rudder0;
//         }
//     }
//
//
//     {
//         name    box;
//         type    cellSet;
//         action  subset;
//         source  boxToCell;
//         sourceInfo
//         {
//             boxes
//             (
//             //     (0 -0.1 -0.1)(0.5 0.1 0.1) //hullBox
//             //     (-0.02 -0.05 -0.03)( -0.01 0.05 0.03) //propeller
//                  (-0.10 -0.0749 -0.00499)(-0.050 0.0749 0.00499) //rudder
//             );
//         }
//     }
//
//     {
//         name    box;
//         type    cellSet;
//         action  invert;
//     }
// );
//
// // ************************************************************************* //
